cask_args appdir: '/Applications'

# taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'facebook/fb'

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install wget with IRI support
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'
brew 'bash'
brew 'bash-completion2'
brew 'git'

# Install other useful binaries
brew 'git-lfs'
brew 'xctool'
brew 'axel'
brew 'speedtest_cli'
brew 'tree'
brew 'mergepbx'
brew 'rbenv'
brew 'ruby-build'
brew 'trash'
brew 'z'
brew 'buck'
brew 'node'
brew 'watchman'

# Keybase and GPG
brew 'gpg'
brew 'gpg-agent'
brew 'pinentry-mac'

# Install casks
cask 'google-chrome'
cask 'google-drive'
cask 'firefox'
cask 'skype'
cask 'the-unarchiver'
cask 'atom'
cask 'bartender'
cask 'boom'
cask 'gfxcardstatus'
cask 'rowanj-gitx'
cask 'istat-menus'
cask 'slack'
cask 'vlc'
cask 'transmission'
cask 'transmission-remote-gui'
cask '1password'
cask 'imageoptim'
cask 'coconutbattery'
cask 'genymotion'
cask 'rocket'
cask 'keybase'
cask 'java'
cask 'kap'

# Install Fonts
cask 'font-varela'
cask 'font-varela-round'
cask 'font-open-sans'
